// Рисуем столько котиков, сколько захотим!
var drawCats = function (howManyTimes) {
    for (var i = 0; i < howManyTimes; i++) {
        console.log(i + " =^.^= ");
    }
};
/* Рисуем столько котиков, сколько захотим! */

/* Синтаксис - правила, которые указывают как объединять символы и слова, чтобы составить работающую программу
Часть синтаксиса - скобки, точки с запятой, фигурные скобки, знаки, специальные слова;
Одна из главных сложностей при изучении - запомнить правила написания команд;
Важно время и опыт;
Важно писать комментарии;
Важно тестировать код и выполнять упражнения - единственный способ научиться программировать;
*/